benchmark-results/8t 48c/redis.txt
threads=8
connections=48

memtier_benchmark -s localhost -t $threads -c $connections -d 20 -n 1000000 --ratio=1:0 --key-minimum=1 --key-maximum=100000000 --hide-histogram --print-percentiles=50,80,90,99,99.9,99.99,99.995,99.999,100 --pipeline=8  -p $port
memtier_benchmark -s localhost -t $threads -c $connections -d 20 -n 1000000 --ratio=1:10 --key-minimum=1 --key-maximum=100000000 --hide-histogram --print-percentiles=50,80,90,99,99.9,99.99,99.995,99.999,100 --pipeline=8  -p $port --key-pattern G:G
memtier_benchmark -s localhost -t $threads -c $connections -d 20 -n 100000 --ratio=1:10 --key-minimum=1 --key-maximum=100000000 --hide-histogram --print-percentiles=50,80,90,99,99.9,99.99,99.995,99.999,100 -p $port --key-pattern G:G
memtier_benchmark -s localhost -t $threads -c $connections -d 20 -n 1000000 --ratio=1:10 --key-minimum=1 --key-maximum=100000000 --hide-histogram --print-percentiles=50,80,90,99,99.9,99.99,99.995,99.999,100 --pipeline=8  -p $port --key-pattern R:R
memtier_benchmark -s localhost -t $threads -c $connections -d 20 -n 100000 --ratio=1:10 --key-minimum=1 --key-maximum=100000000 --hide-histogram --print-percentiles=50,80,90,99,99.9,99.99,99.995,99.999,100 -p $port --key-pattern R:R
Writing results to stdout
[RUN #1] Preparing benchmark client...
[RUN #1] Launching threads now...
[RUN #1 100%, 310 secs]  0 threads:   384000000 ops, 1243341 (avg: 1237082) ops/sec, 80.49MB/sec (avg: 80.09MB/sec),  2.47 (avg:  2.48) msec latency

8         Threads
48        Connections per thread
1000000   Requests per client


ALL STATS
============================================================================================================================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p80 Latency     p90 Latency     p99 Latency   p99.9 Latency p99.990 Latency p99.995 Latency p99.999 Latency    p100 Latency       KB/sec
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
Sets      1238925.29          ---          ---         2.48160         2.25500         2.91100         3.48700         4.63900         9.08700        16.89500        18.30300        20.86300        23.80700     82138.22
Gets            0.00         0.00         0.00             ---             ---             ---             ---             ---             ---             ---             ---             ---             ---         0.00
Waits           0.00          ---          ---             ---             ---             ---             ---             ---             ---             ---             ---             ---             ---          ---
Totals    1238925.29         0.00         0.00         2.48160         2.25500         2.91100         3.48700         4.63900         9.08700        16.89500        18.30300        20.86300        23.80700     82138.22
Writing results to stdout
[RUN #1] Preparing benchmark client...
[RUN #1] Launching threads now...
[RUN #1 100%, 292 secs]  0 threads:   384000000 ops, 1291471 (avg: 1313255) ops/sec, 53.79MB/sec (avg: 54.69MB/sec),  2.37 (avg:  2.34) msec latency

8         Threads
48        Connections per thread
1000000   Requests per client


ALL STATS
============================================================================================================================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p80 Latency     p90 Latency     p99 Latency   p99.9 Latency p99.990 Latency p99.995 Latency p99.999 Latency    p100 Latency       KB/sec
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
Sets       119363.38          ---          ---         2.33751         2.14300         2.60700         3.26300         4.41500         6.91100        11.83900        13.31100        15.10300        18.30300      7925.68
Gets      1193620.63     12903.20   1180717.43         2.33746         2.14300         2.60700         3.26300         4.41500         6.91100        11.77500        13.24700        15.10300        18.30300     48060.22
Waits           0.00          ---          ---             ---             ---             ---             ---             ---             ---             ---             ---             ---             ---          ---
Totals    1312984.01     12903.20   1180717.43         2.33747         2.14300         2.60700         3.26300         4.41500         6.91100        11.77500        13.24700        15.10300        18.30300     55985.90
Writing results to stdout
[RUN #1] Preparing benchmark client...
[RUN #1] Launching threads now...
[RUN #1 100%, 158 secs]  0 threads:    38400000 ops,  242112 (avg:  241652) ops/sec, 10.06MB/sec (avg: 10.07MB/sec),  1.58 (avg:  1.59) msec latency

8         Threads
48        Connections per thread
100000    Requests per client


ALL STATS
============================================================================================================================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p80 Latency     p90 Latency     p99 Latency   p99.9 Latency p99.990 Latency p99.995 Latency p99.999 Latency    p100 Latency       KB/sec
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
Sets        21978.92          ---          ---         1.58910         1.52700         1.68700         1.81500         3.13500         5.50300         9.98300        11.71100        12.92700        15.23100      1459.38
Gets       219786.75      2613.49    217173.26         1.58867         1.52700         1.68700         1.81500         3.13500         5.50300         9.59900        11.39100        12.92700        15.03900      8854.60
Waits           0.00          ---          ---             ---             ---             ---             ---             ---             ---             ---             ---             ---             ---          ---
Totals     241765.67      2613.49    217173.26         1.58871         1.52700         1.68700         1.81500         3.13500         5.50300         9.59900        11.45500        12.92700        15.23100     10313.98
Writing results to stdout
[RUN #1] Preparing benchmark client...
[RUN #1] Launching threads now...
[RUN #1 100%, 308 secs]  0 threads:   384000000 ops, 1189167 (avg: 1246388) ops/sec, 71.84MB/sec (avg: 75.29MB/sec),  2.58 (avg:  2.46) msec latency

8         Threads
48        Connections per thread
1000000   Requests per client


ALL STATS
============================================================================================================================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p80 Latency     p90 Latency     p99 Latency   p99.9 Latency p99.990 Latency p99.995 Latency p99.999 Latency    p100 Latency       KB/sec
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
Sets       113267.67          ---          ---         2.46292         2.25500         2.75100         3.45500         4.63900         7.16700        12.47900        13.69500        15.35900        18.30300      7509.54
Gets      1132664.24   1132664.24         0.00         2.46279         2.25500         2.73500         3.45500         4.63900         7.16700        12.47900        13.69500        15.35900        18.30300     69562.62
Waits           0.00          ---          ---             ---             ---             ---             ---             ---             ---             ---             ---             ---             ---          ---
Totals    1245931.91   1132664.24         0.00         2.46280         2.25500         2.73500         3.45500         4.63900         7.16700        12.47900        13.69500        15.35900        18.30300     77072.16
Writing results to stdout
[RUN #1] Preparing benchmark client...
[RUN #1] Launching threads now...
[RUN #1 100%, 158 secs]  0 threads:    38400000 ops,  245426 (avg:  241645) ops/sec, 14.83MB/sec (avg: 14.60MB/sec),  1.56 (avg:  1.59) msec latency

8         Threads
48        Connections per thread
100000    Requests per client


ALL STATS
============================================================================================================================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p80 Latency     p90 Latency     p99 Latency   p99.9 Latency p99.990 Latency p99.995 Latency p99.999 Latency    p100 Latency       KB/sec
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
Sets        22096.24          ---          ---         1.58947         1.53500         1.69500         1.81500         3.13500         5.53500        10.23900        11.71100        12.99100        13.95100      1464.83
Gets       220959.92    220959.92         0.00         1.58870         1.53500         1.68700         1.81500         3.13500         5.50300        10.43100        11.83900        13.11900        15.80700     13570.11
Waits           0.00          ---          ---             ---             ---             ---             ---             ---             ---             ---             ---             ---             ---          ---
Totals     243056.15    220959.92         0.00         1.58877         1.53500         1.68700         1.81500         3.13500         5.50300        10.36700        11.83900        13.11900        15.80700     15034.94